// @strict-types


#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Создает структуру временного хранилища для обработки
//
// Возвращаемое значение:
//	Структура:
//		* ИспользованиеРазрешено - Булево - флаг разрешающий использовать обработку
//
Функция СоздатьСтруктуру() Экспорт
	
	СтруктураХранилища = Новый Структура();
	
	СтруктураХранилища.Вставить("ИспользованиеРазрешено", Истина);
	
	Возврат СтруктураХранилища;
	
КонецФункции

#КонецОбласти

#КонецЕсли
