// @strict-types


#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытийФормы

//@skip-check module-structure-form-event-regions
&НаКлиенте
Процедура ТипАвторизацииПриИзменении(Элемент)
	
	Если ТипАвторизации = "BasicAuth" Тогда
		Элементы.ЛогинПароль.Видимость = Истина;
	Иначе
		Элементы.ЛогинПароль.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы



#КонецОбласти


#Область ОбработчикиКомандФормы

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Код процедур и функций

#КонецОбласти
